tests/Provider/json/customerinvoice.json

{
  "entityId": 60,
  "customerId": "1",
  "invoiceNumber": 60,
  "invoiceDate": "2020-09-04",
  "dueDate": "2020-09-14",
  "amountInOriginalCurrency": 100.6600,
  "amountInLocalCurrency": 100.6600,
  "amountPaidInOriginalCurrency": 0.0000,
  "amountPaidInLocalCurrency": 0.0000,
  "exchangeRate": 1.0,
  "dateOfLatestPayment": "1899-12-30",
  "currency": "SEK",
  "numberOfRemindersSent": 0,
  "receivableAccount": "1510",
  "registeredByUser": "null",
  "orderNumber": null,
  "paid": false,
  "preliminary": false,
  "type": "Faktura",
  "typeOrigin": "F",
  "paymentType": 0,
  "journalId": null,
  "journalEntryId": null,
  "journalEntryDate": null,
  "externalInvoiceId": 0,
  "costCenterId": "",
  "costBearerId": "",
  "projectId": "",
  "documentIds": [],
  "associatedCustomerPayments": [],
  "subLedgerEntries": [],
  "updatedDate": "2020-09-04",
  "customerName": "Test",
  "ledgerNumber": 45,
  "rotRutAmount": 0.0,
  "createdWith": "bla",
  "connectedInvoices": [],
  "status": [0]
}
